{"title":"了解蚂蚁金融云","slug":"2017-07-what-is-antcloud","date":"2017-07-13T16:00:00.000Z","updated":"2017-07-14T11:21:13.000Z","comments":true,"path":"api/articles/2017-07-what-is-antcloud.json","excerpt":"蚂蚁金融云是蚂蚁金服基于多年积累的金融级互联网技术，为金融机构提供行业云计算服务的平台。蚂蚁金融云整合了蚂蚁技术经多年双十一大促锤炼的大规模交易处理能力，并且面向未来将逐步开放大规模实时决策能力和大规模数据集成与洞察分析能力，持续为合作伙伴提供金融级的基础技术服务。通过公有云、专有云的形式进行相关技术的产品化和标准化输出，让更多的金融机构可以使用蚂蚁的分布式计算、大数据、移动、人工智能、安全风控等金融级能力，助力金融机构降低创新成本、更快速地向新金融转型升级，共同探索全新业态。自2015年9月发布以来承担着蚂蚁技术能力向生态开放的使命，至今服务了数百家客户和生态合作伙伴，是蚂蚁金服施行“TechFin”通过技术赋能金融业务战略的重要组成部分。","content":"<p>中国金融行业正处在向互联网转型的关键时期。经济结构调整、金融自由化推进加速、云计算和分布式基础技术的百家争鸣、移动互联网技术发展以及大数据技术的爆发等多重力量叠加推动金融行业进入前所未有的变局之中，金融机构将经历前所未有的挑战，但同时也会面临更多新的商业机会。</p>\n<p>在接下来的一段时间，我们会为大家准备了一系列的文章，系统化的为大家分享蚂蚁金融云所解决的问题，其定位和构成，以及构建其上的业务场景和技术产品。</p>\n<h2 id=\"什么是蚂蚁金融云\"><a href=\"#什么是蚂蚁金融云\" class=\"headerlink\" title=\"什么是蚂蚁金融云\"></a>什么是蚂蚁金融云</h2><p>蚂蚁金融云是蚂蚁金服基于多年积累的金融级互联网技术，为金融机构提供行业云计算服务的平台。蚂蚁金融云整合了蚂蚁技术经多年双十一大促锤炼的大规模交易处理能力，并且面向未来将逐步开放大规模实时决策能力和大规模数据集成与洞察分析能力，持续为合作伙伴提供金融级的基础技术服务。通过公有云、专有云的形式进行相关技术的产品化和标准化输出，让更多的金融机构可以使用蚂蚁的分布式计算、大数据、移动、人工智能、安全风控等金融级能力，助力金融机构降低创新成本、更快速地向新金融转型升级，共同探索全新业态。 </p>\n<p>通过这些核心技术手段的实现，蚂蚁金服具备了超大规模的交易处理能力，已经成功助力了余额宝、芝麻信用、支付宝开放平台、蚂蚁财富等众多创新业务。<strong>蚂蚁金融云把蚂蚁的核心技术产品开放出来，让更多的金融机构可以使用这些能力，助力金融机构降低创新成本、更快速地向新金融转型升级，共同探索全新业态</strong>。自2015年9月发布以来承担着蚂蚁技术能力向生态开放的使命，是蚂蚁金服施行“TechFin”通过技术赋能金融业务战略的重要组成部分。</p>\n<p>“网商银行”以及印度最大移动支付公司“Paytm”，以及其他蚂蚁全球生态合作的金融机构等，如全球首家上云的相互制寿险机构“信美相互”，都采用了这些超大规模金融级技术：</p>\n<ul>\n<li>基于金融云计算平台，“网商银行”拥有处理高并发金融交易、海量大数据和弹性扩容的能力，可以利用互联网和大数据的优势，给更多小微企业提供金融服务；</li>\n<li>蚂蚁金融云助力“Paytm”基础技术设施转型，确保其用户数从1700多万快速增长至2.2亿的过程中，仍能平稳向数以亿计人群提供普惠金融服务；</li>\n<li>“信美相互”的技术架构基于蚂蚁金融云提供的云计算、人工智能、大数据、分布式金融级交易架构、移动应用平台五大技术，保证了数据安全、异地多活秒级容灾，符合金融安全监管与合规要求，节省至少80%的IT成本。</li>\n</ul>\n<h2 id=\"蚂蚁金融云的技术架构\"><a href=\"#蚂蚁金融云的技术架构\" class=\"headerlink\" title=\"蚂蚁金融云的技术架构\"></a>蚂蚁金融云的技术架构</h2><p>随着蚂蚁金服的业务不断发展和技术的进步，IOE等传统商业软件难以满足大规模、低成本、高可靠的要求。蚂蚁的技术架构设计目标，以具有自主知识产权的技术、普通x86服务器为基础，采用云计算的方式去支持未来更大规模、可应急的交易总量以及更低的成本。蚂蚁自研的研发部署平台、中间件、分布式关系型云数据库OceanBase等关键基础技术产品组成了“金融云”架构，为亿级之上更大规模更低成本的伸缩能力铺平了道路。</p>\n<p>为顺应金融发展趋势，我们认为未来的金融云在低成本、高弹性、按需服务的基础上，需进一步基于分布式架构提升并发处理能力、高可靠可用能力及安全合规能力，进一步增强移动能力及大数据分析能力，并实现云管理及应用治理的自动化与智能化，为企业的云金融建设提供更有力的支撑。</p>\n<p>基于此，蚂蚁金融云技术架构可抽象成如下表示：</p>\n<p><img src=\"https://private-alipayobjects.alipay.com/alipay-rmsdeploy-image/skylark/png/7618/f10d869015bd603f.png\" alt=\"蚂蚁金融云技术架构.png\">  </p>\n<p>在云计算基础IaaS层、基础PaaS中间件层及产品层共同支撑下，蚂蚁金融云为金融行业的稳妥创新提供了所必要的、经过蚂蚁金服实际业务验证的技术能力：</p>\n<ol>\n<li>分布式计算能力：屏蔽分布式架构研发及运维复杂性，帮企业轻松实现具备万笔/秒级并发能力的分布式系统，并严格保证数据一致性。</li>\n<li>治理与分析能力：为企业提供统一规范的架构保障，轻松理顺系统依赖关系，直观展示调用链路及业务瓶颈，实时监控系统健康状况，并提供在线debug能力及问题分析能力。</li>\n<li>移动能力：为企业提供一站式移动APP解决方案，降低开发门槛、提升开发效率、减少开发成本、提高上线速度，并提供全面监控体系、动态热修复能力及完整安全机制。</li>\n<li>大数据能力：为企业提供一体化大数据解决方案，全面集成数据开发、管理、分析、挖掘、共享工具，具备EB级数据处理、毫秒级实时分析及快速需求响应能力。</li>\n<li>业务连续性能力：为企业提供一整套业务连续性方案，通过两地三中心部署、应用和数据库无单点设计、秒级监控、分钟级故障切换、流量管控，保证系统持续可用。</li>\n<li>云计算管理能力：为企业提供自动化资源管理工具，通过基础设施虚拟化、资源使用弹性化有效降低资源投入及管理成本，通过多租户安全隔离及操作权限约束保障云资源安全。</li>\n<li>金融级安全与合规能力：为企业提供从底层到应用的整套安全解决方案，底层设施获得云安全国际认证、公安部信息安全等级保护等合规认证，应用层涵盖物理安全、网络完全、主机安全、应用安全及数据安全，全方位为安全保驾护航。</li>\n</ol>\n<h2 id=\"关键技术产品\"><a href=\"#关键技术产品\" class=\"headerlink\" title=\"关键技术产品\"></a>关键技术产品</h2><h3 id=\"金融级分布式中间件\"><a href=\"#金融级分布式中间件\" class=\"headerlink\" title=\"金融级分布式中间件\"></a>金融级分布式中间件</h3><p>蚂蚁金服的基础技术产品利用机房级弹性服务架构、多维度分布式数据伸缩、单元化的部署能力等手段来解决分布式服务与数据带来的挑战；利用基于TCC分布式事务框架、可靠事务消息服务等手段来解决分布式事务与协调带来的挑战；利用多地多中心部署模式、异地多活单元化架构、机房间流量调拨等手段来保障强一致容灾以及城市级容灾；用按单元弹性扩容、按业务单元进行弹性扩容等手段来解决弹性供给与调度。而以上关键技术的核心就是蚂蚁的金融级分布式中间件。</p>\n<ul>\n<li>微服务产品提供金融级分布式架构的基础设施能力，包括服务注册、定时任务、服务查询等，帮助企业级客户快速构建并托管基于微服务架构的分布式应用。微服务产品为传统单体应用架构深入拆分为分布式应用架构提供稳定可靠的基础框架，帮助简化建设的复杂度，让业务开发人员可以专注于业务逻辑实现，提升研发效率。服务注册与发现功能帮助自动发现服务，依赖关系视图功能够帮助清晰化依赖关系，快速查找和定位到相依赖的服务，帮助用户简化分布式系统的管理。</li>\n<li>分布式消息中间件，全方位为金融业务系统或组件之间提供高可靠、高效、事务一致性的数据异步通信，可降低系统间耦合度，从而提高整个系统的吞吐量、可扩展性和高可用性。</li>\n<li>数据访问代理是蚂蚁金服自主研发的金融级分布式数据库中间件，用于解决海量请求下数据访问的瓶颈及数据库的容灾问题。专注于为海量数据访问提供低成本、高性能、高可用的轻量级解决方案，确保在高并发、数据库异常的情况下依然非常稳定与可靠。</li>\n<li>分布式事务中间件，用来保障在大规模分布式环境下业务活动的最终一致性。在蚂蚁金服内部被广泛地应用于交易／转账／红包等核心资金链路，服务着亿级用户的资金操作。</li>\n<li>分布式链路跟踪是蚂蚁金服自主研发的金融级分布式链路分析中间件，包括链路查询、多维查询、异常跟踪等，帮助企业级客户快速构建系统调用链关系，全方位为金融业务系统提供实时高效的系统调用分析、业务容量评估、业务异常定位的能力。</li>\n</ul>\n<h3 id=\"分布式关系型数据库OceanBase\"><a href=\"#分布式关系型数据库OceanBase\" class=\"headerlink\" title=\"\b分布式关系型数据库OceanBase\"></a>\b分布式关系型数据库OceanBase</h3><p>OceanBase是阿里巴巴／蚂蚁金服自主研发的支持海量数据且具有良好扩展性的金融级关系型数据库。是中国第一个具有自主知识产权的分布式关系数据库，也是全球首个应用在金融核心业务的分布式关系数据库。OceanBase具备高可用、高性能、高可扩展性，在功能上兼容MySQL等特点，无需共享存储设备、以普通PC Server的低廉成本提供金融级可靠的数据库服务。</p>\n<p>2016年“双11”12万笔／秒支付峰值的背后正是OceanBase发挥关键作用。2016年，OceanBase被第三届世界互联网大会选入“世界互联网代表性领先科技成果”。目前OceanBase已经在支付宝的包括交易、支付、账务、会员在内的全部核心系统中完全取代了Oracle。</p>\n<h3 id=\"一站式移动平台mPaaS\"><a href=\"#一站式移动平台mPaaS\" class=\"headerlink\" title=\"一站式移动平台mPaaS\"></a>一站式移动平台mPaaS</h3><p>移动应用开发、测试、运营及运维的云到端一站式解决方案。能有效降低技术门槛、减少研发成本、提升开发效率，协助企业快速搭建稳定高质量的移动应用，使生态伙伴、ISV及移动开发者能够快速达到跟支付宝App对等的客户端以及服务端的能力。支付宝的客户端框架组件及配套的全生命周期的云端服务已经产品化及标准化，作为mPaaS移动平台向生态输出。支付宝App正在承载日常金融生活、社交、线下服务、公益、第三方开放服务的生活互动平台，是一个足够开放、动态化的超级移动应用，加载了内部数百个功能模块，亦能投放多个行业的第三方应用，同时满足了金融级性能、稳定和安全的需求。</p>\n<h3 id=\"金融级大数据平台\"><a href=\"#金融级大数据平台\" class=\"headerlink\" title=\"金融级大数据平台\"></a>金融级大数据平台</h3><p>为了应对风险决策、信用决策、营销决策以及各种金融服务中实时决策相应的挑战，必须首先做好在线特征的实时计算与学习，模型算法全生命周期的服务与管理体系。蚂蚁金服建立了自己的实时特征计算平台，用基于Velocity的特征实时计算、在线离线统一的特征计算体系、关系特征计算引擎等手段解决特征计算的时效性。为提升使⽤⼤数据的效率，把⼈从繁重的数据开发、数据清洗等底层⼯作中解放出来，让机器更⾃动化、更智能化，蚂蚁研发了⼀套端到端的敏捷⼤数据⽅案，从数据采集、数据开发、数据分析、数据挖掘到更⾼阶的机器学习，提供了⼀站式的平台。</p>\n<h3 id=\"智能云客服\"><a href=\"#智能云客服\" class=\"headerlink\" title=\"智能云客服\"></a>智能云客服</h3><p>企业级客服中心解决方案，通过人工智能技术手段增强客户服务能力，降低客户服务成本，依托大数据平台，打造一套完整的智能服务体系，输出高质量、自动化的智能服务能力和方式。智能云客服体系从支付服务扩展到了理财、保险、信贷等服务，新技术的应用进一步加强了客户体验，提升了服务效率。</p>\n<h2 id=\"了解更多\"><a href=\"#了解更多\" class=\"headerlink\" title=\"了解更多\"></a>了解更多</h2><p>请关注我们的后续文章，进一步了解各产品领域的解决方案和进一步技术细节。如有进一步合作、试用需求，请通过以下渠道联系我们。</p>\n<ul>\n<li>平台主页：<a href=\"https://www.cloud.alipay.com\" target=\"_blank\" rel=\"external\">https://www.cloud.alipay.com</a></li>\n<li>业务咨询：<a href=\"mailto:fincloud@cloud.alipay.com\" target=\"_blank\" rel=\"external\">fincloud@cloud.alipay.com</a> </li>\n<li>技术咨询：<a href=\"mailto:techsupport@cloud.alipay.com\" target=\"_blank\" rel=\"external\">techsupport@cloud.alipay.com</a></li>\n<li>微信公众号：蚂蚁金服科技 \bAnt-TechFin<br><img src=\"https://private-alipayobjects.alipay.com/alipay-rmsdeploy-image/skylark/png/7618/10d8584bac589d80.png\" alt=\"wechatQR.png\"> </li>\n</ul>\n","categories":[{"name":"焦点动态","path":"api/categories/焦点动态.json"}],"tags":[{"name":"焦点动态","path":"api/tags/焦点动态.json"}],"thumbnail":null,"author":"首仁"}